snlkuharlocal/src/DataProcessors/ВыгрузкаБланкаЗаказаКлиенту/ВыгрузкаБланкаЗаказаКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаБланкаЗаказаКлиенту</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСкидокКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзменийУсловийРаботы</name>
    <type>
      <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/КлючиБезопасногоХранилищаДанных/КлючиБезопасногоХранилищаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиБезопасногоХранилищаДанных</name>
  <comment>// Ихсанов Д. А. 30.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2523</comment>
  <predefined>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПоток</name>
      <description>Данные doc flow rabbi платежная информация исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПоток</name>
      <description>Данные doc flow rabbit договоры входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПоток</name>
      <description>Данные doc flow rabbit договоры исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПотокТест</name>
      <description>Данные doc flow rabbit платежная информация исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеHTTPПубликацииSNL</name>
      <description>Данные HTTP публикации SNL</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPCollant</name>
      <description>Данные авторизации к FTP collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPWatcom</name>
      <description>Данные авторизации к FTP Watcom</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКлиента</name>
      <description>Данные авторизации к FTP клиента</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКонтур</name>
      <description>Данные авторизации к FTP контур</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPНаСайтеCollant</name>
      <description>Данные авторизации к FTP на сайте collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPСклада</name>
      <description>Данные авторизации к FTP Склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКHTTPОбмену</name>
      <description>Данные авторизации к http обмену</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКWebСервисуСклада</name>
      <description>Данные авторизации к web сервису склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииАрхивЛогов</name>
      <description>Данные авторизации к базе архива логов</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_31</name>
      <description>Данные авторизации к ЗУП_31</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_ЕЕ</name>
      <description>Данные авторизации к ЗУП_ЕЕ</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуХелпДеск</name>
      <description>Данные авторизации к почтовому серверу</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуRobot</name>
      <description>Данные авторизации к почтовому серверу robot</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуScud</name>
      <description>Данные авторизации к почтовому серверу scud</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуЕкод</name>
      <description>Данные авторизации к почтовому серверу Екод</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуCollant</name>
      <description>Данные авторизации к сайту Collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуIdexgroup</name>
      <description>Данные авторизации к сайту idexgroup</description>
    </items>
    <items>
      <name>ДанныеАвторизацииОзонТокен</name>
      <description>Данные авторизации озон токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_БТК_Токен</name>
      <description>Данные авторизации РВБ БТК токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_ЕЕЭ_Токен</name>
      <description>Данные авторизации РВБ ЕЕЭ токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииФормированиеБланкаSecretKey</name>
      <description>Данные авторизации формирование бранка Secret Key</description>
    </items>
    <items>
      <name>ПутьКФайлуОповещенияОбОшибкеТСД_RDP</name>
      <description>Путь к файлу оповещения об ошибке ТСД RDP</description>
    </items>
    <items>
      <name>ХранилищеДанныхS3</name>
      <description>Хранилище данных s3</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ИспользуемыеТипыКлючей</name>
    <attributes>
      <name>ТипКлюча</name>
      <type>
        <types>EnumRef.ТипыКлючейБезопасногоХранилищаДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ВыгрузкаБланкаЗаказаКлиенту/ObjectModule.bsl
Перем ИмяОтчета;
Перем Макет;
Перем ТД;
Перем ТИ;
Перем КоличествоСкладов;
Перем ТекЦена;
Перем КаталогКартинок;
Перем фВыводитьКартинки; 
Перем фВключатьНули;
Перем фРазворачиватьПоСкладам;
Перем фНеКонтролироватьОстатки;
Перем ИспользоватьНоменклатурнуюМатрицу;
Перем ТипЦен;
Перем ПостроительОтчета;
//Перем ПостроительОтчета;


Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	//// Вставить содержимое обработчика.
	//Обраб  = обработки.ФормированиеБланковЗаказов.Создать();
	//
	//
	//ФОбр = обработки.ФормированиеБланковЗаказов.ПолучитьФорму("Форма");
	//
	//
	//ФОбр.типцен = справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	//ФОбр.Дата2 = текущаяДата();
	//
	//ФОбр.ЭлементыФормы.ИмяФайлаЗаказа.значение = "C:\SNL\1\1.xls";
	//НН = ФОбр.ЭлементыФормы.Отбор.колонки.Добавить("Склад");
	//
	//Обраб.НастроитьПостроитель();
	// 
	
	//пп=2;
	
	//  
	//  Постр = ФОбр.построительОтчета;
	//  
	//  Постр.ДоступныеПоля.Добавить("Склад",Истина);
	////  Постр.ЗаполнитьНастройки();
	//  
	//  сзОтбор = Постр.Отбор;             
	//  сзОтбор.Добавить("СтатьяЗатрат");
	//  сзОтбор["СтатьяЗатрат"].Использование = Истина;
	
	
	//сзОтбор["СтатьяЗатрат"].ВидСравнения = перечисления.вид;
	//сзОтбор["СтатьяЗатрат"].Значение = ПостроительОтчета.Отбор.Склад.Значение;
	
	
	//Если ПостроительОтчета.Отбор.Найти("ЗаказКонтрагент") = Неопределено Тогда
	//    ПостроительОтчета.Отбор.Добавить("ЗаказКонтрагент", "ЗаказКонтрагент", "Заказ покупателя контрагент");
	//    ПостроительОтчета.Отбор.ЗаказКонтрагент.Установить(ОтборКонтрагент);
	//Иначе
	//    ПостроительОтчета.Отбор.ЗаказКонтрагент.Установить(ОтборКонтрагент);
	//КонецЕсли;
	//ПостроительОтчета.Отбор.ЗаказКонтрагент.Использование = Ложь;
	//
	//
	//
	
	
	//Обраб.ССортировкойПоБрендам();
	//СортироватьПоБрендам
	
	
	
	
	НастроитьПостроитель();
	ПолучитьНастройкуОтчета();
	НастроитьПостроительПоУмолчанию();
	//ВосстановитьНастройкиОтчета(ЭтаФорма);
	ССортировкойПоБрендам();
	
	пп = 1;
	
	
	
КонецПроцедуры


// Нечаева 26.11.2009 17:08:21 +

Функция СкидкаКонтрагента1(Номенклатура,ТипСкидок_Контрагент)  Экспорт
	
	Запрос=Новый Запрос;
	//Запрос.Текст="
	//|ВЫБРАТЬ ПЕРВЫЕ 1		
	//|	Скидка,ТипЦен,
	//|	ВЫБОР 
	//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
	//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
	//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
	//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
	//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
	//// Кухарь А.Ю. 13.10.2022 начало
	////+1 уровень иерархии
	//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
	//// Кухарь А.Ю. 13.10.2022 конец
	//
	//|	ИНАЧЕ 100 
	//|	КОНЕЦ КАК Уровень
	//|ИЗ
	//|	Справочник.Контрагенты.Скидки
	//|ГДЕ
	//|	Ссылка = &Контрагент		
	//|	И Номенклатура В (&СписокПозиций)
	//|УПОРЯДОЧИТЬ ПО Уровень";
	
	// Шворобей ВЮ 05.03.2024 ++
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиКонтрагентов.Скидка КАК Скидка,
	|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
	|			ТОГДА 0
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
	|			ТОГДА 1
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
	|			ТОГДА 2
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
	|			ТОГДА 3
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
	|			ТОГДА 4
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
	|			ТОГДА 5
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
	|	И СкидкиКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень";
	// Шворобей ВЮ 05.03.2024 ++
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
	
	СписокПозиций=Новый Массив;
	
	Уровень=0;		
	ТекРодитель=Номенклатура;
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	//Пока Уровень<5 Цикл
	Пока Уровень<6 Цикл
		// Кухарь А.Ю. 13.10.2022 конец
		
		СписокПозиций.Добавить(ТекРодитель);		
		Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
		
		Уровень=Уровень+1;
		ТекРодитель=ТекРодитель.Родитель;			
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
	
	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		ТипЦенСкидок=Выборка.ТипЦен;
		Возврат  Выборка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ЦенаКонтрагента1(Номенклатура,ТипЦен,контрагент = неопределено)  Экспорт
	
	Если Контрагент = неопределено Тогда
		контрагент = справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	ТекТипЦен			= ТипЦен;
	Распродажа			= Ложь;
	Скидка=0;
	//--------------------------------------------------------------
	//                   с учетом скидок 
	//--------------------------------------------------------------
	Если НЕ Контрагент.Пустая() Тогда
		
		СкидкаВЫб=СкидкаКонтрагента1(Номенклатура,Контрагент);
		Если  СкидкаВыб=Неопределено Тогда
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			Если СкидкаКонтрагента>0 Тогда
				
				Скидка=СкидкаКонтрагента;
				ТекТипЦен=ПолучитьРеквизитРодителя(Контрагент,"ТипЦен");
				
			КонецЕсли; 
		Иначе
			Скидка=СкидкаВыб.Скидка;
			ТекТипЦен=СкидкаВыб.ТипЦен;
		КонецЕсли; 
		
	КонецЕсли;
	
	
	//Валюта=ТипЦен.Валюта;
	//Курс=ПолучитьКурсВалюты_ПоРусски(Валюта, Дата2);
	//Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,ТипЦен,Валюта,Курс,Дата2);
	
	Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,ТекТипЦен,ТекТипЦен.Валюта,ПолучитьКурсВалюты(ТекТипЦен.Валюта,Дата2).Курс,Дата2);
	
	//определение - ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
	Если Цена=Неопределено Тогда
		
		Цена=0;
		
	КонецЕсли; 
	
	
	Если Скидка+0>0 Тогда
		
		Цена=Формат(Цена-(Цена*Скидка/100),"ЧДЦ=2");
		
	КонецЕсли; 
	//крохин начало
	//крохин начало 06.12.2017
	//наценка тоже разрешена
	//Если СкидкаИзФормы+0>0 Тогда
	//Если СкидкаИзФормы <> 0 Тогда
	////крохин конец 06.12.2017			
	//	Цена=Формат(Цена-(Цена*СкидкаИзФормы/100),"ЧДЦ=2");
	//	
	//КонецЕсли; 
	//крохин конец
	
	//-----------------------------------------------------
	
	//Если ТипЦен_SALE.Пустая() И НЕ Контрагент.Пустая() Тогда
	//	ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	//КонецЕсли; 
	//
	//Если НЕ ТипЦен_SALE.Пустая() Тогда
	//	
	//	ЦенаРаспродажа=ПолучитьЦенуНоменклатуры(Номенклатура,,ТипЦен_SALE,ТипЦен_SALE.Валюта,ПолучитьКурсВалюты(ТипЦен_SALE.Валюта,Дата2).Курс,Дата2);
	//	//ЦенаКонтрагента(Номенклатура,ТипЦен_SALE);
	//	Если НЕ ЦенаРаспродажа=Неопределено И ЦенаРаспродажа <> 0 Тогда
	//		
	//		Цена=ЦенаРаспродажа;
	//		ТекТипЦен=ТипЦен_SALE;
	//		
	//	КонецЕсли; 
	//	
	//КонецЕсли; 
	
	Возврат Цена;
	
КонецФункции


// Нечаева 26.11.2009 17:08:24 -

Функция ПолучитьКодТовара(Модель,Размер,Цвет) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка.Код КАК Код80,
	|	Ссылка.Код77 КАК Код77
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Родитель = &Модель
	|	И Размер = &Размер
	|	И Цвет = &Цвет";
	
	Запрос.УстановитьПараметр("Модель",Модель);
	//крохин начало18.03.2011
	//размер- код размера
	//	Запрос.УстановитьПараметр("Размер",Размер);
	Запрос.УстановитьПараметр("Размер",Справочники.Размеры.НайтиПоКоду(Размер));
	//крохин конец
	Запрос.УстановитьПараметр("Цвет",Цвет);	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Возврат Выборка[фВидКодов];	
		//Возврат Выборка.Код77;
		//Мессерле
		Возврат Выборка.Код80;
		//Мессерле
		
	КонецЦикла; 
	
	Возврат "";
КонецФункции // НайтиТовар()

Процедура УправлениеВидимостью() Экспорт	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////
//РАБОТА С ПОСТРОИТЕЛЕМ
Функция ОтформатироватьПостроитель(Построитель)     Экспорт
	Шаблон=ПолучитьМакет("Отчет");	
	
	Макет=Построитель.Макет;
	Для СчС=1 По Макет.ВысотаТаблицы Цикл	
		Для СчК=1 По Макет.ШиринаТаблицы Цикл	
			ТекОбласть=Макет.Область("R"+СчС+"C"+СчК);
			Если ТекОбласть.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
				ОбластьШаблона=Шаблон.Области.Найти(ТекОбласть.Параметр);
				Если ОбластьШаблона<>Неопределено Тогда
					ТекОбласть.Формат				=ОбластьШаблона.Формат;				
					ТекОбласть.ШиринаКолонки		=ОбластьШаблона.ШиринаКолонки;
					ТекОбласть.ВыделятьОтрицательные=ОбластьШаблона.ВыделятьОтрицательные;
					ТекОбласть.АвтоОтступ=ОбластьШаблона.АвтоОтступ;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	Построитель.Макет=Макет;
	
	Если Построитель.Макет.Области.Найти("ШапкаТаблицы")<>Неопределено Тогда
		Построитель.Макет.Области.ШапкаТаблицы.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;	
	Иначе
		Для Каждого Колонка Из ПостроительОтчета.ИзмеренияКолонки Цикл
			Для Сч=1 По 3 Цикл
				ТекИмяОбласти=""+Колонка.Имя+"Уровень"+Сч;
				ТекОбласть=Построитель.Макет.Области.Найти(ТекИмяОбласти);
				Если ТекОбласть<>Неопределено Тогда
					ТекОбласть.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;			
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;  
	КонецЕсли;	
КонецФункции // ОтформатироватьПостроитель()

Процедура НастроитьПостроитель() экспорт 
	
	
	ПостроительОтчета.Текст="
	|ВЫБРАТЬ
	|	СпрНоменклатура.Родитель.Родитель.Родитель					КАК Брэнд,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель.Родитель)	КАК БрэндПредставление,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель)			КАК КоллекцияПредставление,
	|	СпрНоменклатура.Родитель КАК Модель,
	|	СпрНоменклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	СпрНоменклатура.Родитель.ШтукВКоробочке КАК ШтукВБлочке,	
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель) КАК МодельПредставление,	
	|	СпрНоменклатура.Родитель.КодПроизводителя КАК КодПроизводителя,	
	|	СпрНоменклатура.Цвет КАК Цвет,		
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Цвет) КАК ЦветПредставление,
	|	СпрНоменклатура.Родитель.Коллекция КАК Коллекция,
	
	|	СпрНоменклатура.Размер.Родитель КАК РазмерныйРяд,
	//крохин начало 17.03.2011
	//поменял упорядочивание размеров со ссылок на коды
	//|	СпрНоменклатура.Размер КАК Размер,
	|	СпрНоменклатура.Размер.Код КАК Размер,
	//крохин конец
	|	СпрСклады.Ссылка КАК Склад,
	|	(&Остаток*ЕстьNULL(Остатки.КоличествоОстаток,0)+&Резерв*ЕстьNULL(Резервы.КоличествоОстаток,0)) КАК КолКон,
	|	ЕстьNULL(Остатки.КоличествоОстаток,0)	КАК ОстКон	
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Склады КАК СпрСклады
	|ПО 1=1
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2,{Номенклатура.*,Склад.*}) КАК Остатки				
	|ПО СпрНоменклатура.Ссылка=Остатки.Номенклатура И СпрСклады.Ссылка=Остатки.Склад
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	РегистрНакопления.РезервыТМЦ.Остатки(&Дата2,{Номенклатура.*,Склад.*}) КАК Резервы
	|ПО СпрНоменклатура.Ссылка=Резервы.Номенклатура И СпрСклады.Ссылка=Резервы.Склад	
	|ГДЕ НЕ СпрНоменклатура.ЭтоГруппа	
	|	И (&ВключатьНули ИЛИ (&Остаток<>0 И Остатки.КоличествоОстаток ЕСТЬ НЕ Null) ИЛИ (&Резерв<>0 И Резервы.КоличествоОстаток ЕСТЬ НЕ Null))
	|{
	|	ГДЕ 
	|	СпрНоменклатура.Ссылка.*			КАК Номенклатура,
	|	СпрНоменклатура.Родитель.Коллекция	КАК Коллекция,
	|	СпрСклады.Ссылка.*					КАК Склад
	|}
	|ИТОГИ 
	|	СУММА(КолКон)
	|ПО ОБЩИЕ	
	|{ИТОГИ ПО 	
	|	РазмерныйРяд,
	|	Брэнд,Модель,Цвет,Размер,Склад	
	|}	
	|АВТОУПОРЯДОЧИВАНИЕ"	
	;
	
	ПостроительОтчета.Параметры.Вставить("Длина",3);
	ПостроительОтчета.ЗаполнитьНастройки();
	ПостроительОтчета.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка;
	ПостроительОтчета.ВыводитьДетальныеЗаписи=Ложь;
	
	ПостроительОтчета.ДобавлениеПредставлений=ТипДобавленияПредставлений.Добавлять;		
	
	ПостроительОтчета.ДоступныеПоля["КолКон"].Представление			="Кол. кон.";
	
	//ПостроительРасшифровки.Текст=ПостроительОтчета.Текст;	
КонецПроцедуры

Процедура НастроитьПостроительПоУмолчанию() Экспорт
	ПостроительОтчета.ВыбранныеПоля.Очистить();		
	
	ПостроительОтчета.ВыбранныеПоля.Добавить("КолКон");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ШтукВКоробке");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ШтукВБлочке");
	ПостроительОтчета.ВыбранныеПоля.Добавить("КодПроизводителя");
	ПостроительОтчета.ВыбранныеПоля.Добавить("Коллекция");
	ПостроительОтчета.ВыбранныеПоля.Добавить("КоллекцияПредставление");
	
	ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("РазмерныйРяд",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Брэнд",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Модель",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Цвет",,ТипИзмеренияПостроителяОтчета.Элементы);	
	
	ПостроительОтчета.ИзмеренияКолонки.Очистить();
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Склад",,ТипИзмеренияПостроителяОтчета.Элементы);
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Размер",,ТипИзмеренияПостроителяОтчета.Элементы);
	
	
	ОтборКоличество=ПостроительОтчета.Отбор.Количество();
	Для Н = 1 По ОтборКоличество Цикл
		ПостроительОтчета.Отбор.Удалить(ОтборКоличество - Н);
	КонецЦикла;
	
	ПостроительОтчета.Отбор.Добавить("Склад");	
	ПостроительОтчета.Отбор.Добавить("Номенклатура");	
	ПостроительОтчета.Отбор["Номенклатура"].ВидСравнения=ВидСравнения.ВИерархии;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////
//ТЕКУЩАЯ НАСТРОЙКА ОТЧЕТА
Функция ПолучитьНастройкуОтчета() Экспорт
	
	//
	типцен = справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	Дата2 = текущаяДата();
	// список для номенклатуры
	
	Настройка=Новый Соответствие;
	Настройка.Вставить("НастройкиПостроителя",ПостроительОтчета.ПолучитьНастройки());
	Настройка.Вставить("ТипЦен",ТипЦен);
	//Настройка.Вставить("ТипЦен_Sale",ТипЦен_Sale);
	//Настройка.Вставить("Контрагент",Контрагент);
	//Настройка.Вставить("Договор",Договор);
	//Настройка.Вставить("ФактАдрес",ФактАдрес);
	//крохин начало 19.03.2012
	//ИспользоватьНоменклатурнуюМатрицу
	//Настройка.Вставить("ИспользоватьЦеныМатрицы",ИспользоватьЦеныМатрицы);
	//крохин конец 19.03.2012
	
	Возврат Настройка;
КонецФункции // ПолучитьНастройкуОтчета()

Функция ВосстановитьНастройкуОтчета(Настройка=Неопределено) Экспорт
	
	Если Настройка<>Неопределено И ТипЗнч(Настройка)=Тип("Соответствие") Тогда		
		ПостроительОтчета.УстановитьНастройки(Настройка["НастройкиПостроителя"]);		
		ТипЦен=Настройка["ТипЦен"];
		ТипЦен_Sale=Настройка["ТипЦен_Sale"];		
		Контрагент=Настройка["Контрагент"];
		Договор=Настройка["Договор"];
		ФактАдрес=Настройка["ФактАдрес"];
		//крохин начало 19.03.2012
		//ИспользоватьНоменклатурнуюМатрицу
		ИспользоватьЦеныМатрицы = Настройка["ИспользоватьЦеныМатрицы"];
		//крохин конец 19.03.2012
	Иначе	
		ПостроительОтчета.Отбор.Сбросить();
		НастроитьПостроительПоУмолчанию();			
	КонецЕсли; 
	
	УправлениеВидимостью();
	
КонецФункции // ВосстановитьНастройкуОтчета()


Функция СоздатьТаблицуСтрок() Экспорт
	Т=Новый ДеревоЗначений;	
	Т.Колонки.Добавить("СтрокаИтога",ПолучитьОписаниеТиповЧисла(10,0));
	Т.Колонки.Добавить("ИмяИтога");
	Т.Колонки.Добавить("ТаблицаСтрок");
	Возврат Т;
КонецФункции //СоздатьТаблицуСтрок

Процедура ПрописатьФормулы(ТД,Лист,СтрокиТИ,ЧислоРазмеров) Экспорт
	Перем ФормулаВ,ФормулаГ;
	
	ШиринаСекцииНачало=Макет.ПолучитьОбласть("Заголовок|Начало").ШиринаТаблицы;
	ПозицияГорИтога=ШиринаСекцииНачало+ЧислоРазмеров+1;
	
	ФормулаГ="=SUM(RC[-"+ЧислоРазмеров+"]:RC[-1]";
	Для Каждого СтрокаТИ Из СтрокиТИ Цикл		
		СтрокиДанных=СтрокаТИ.Строки;                             
		Если СтрокиДанных.Количество()>0 Тогда
			ФормулаВ="";
			
			Для Каждого СтрокаДанных Из СтрокиДанных Цикл				
				ФормулаВ=ФормулаВ+?(ПустаяСтрока(ФормулаВ)=1,"","+")+"R"+СтрокаДанных.СтрокаИтога+"C";				
				Лист.Cells(СтрокаДанных.СтрокаИтога,ПозицияГорИтога).FormulaR1C1=ФормулаГ;
				//		Сообщить(ФормулаГ);
			КонецЦикла;						
			
			ФормулаВ="="+ФормулаВ;
			
			НачСмещение=ШиринаСекцииНачало+1;		
			Для Сч=НачСмещение по (НачСмещение+ЧислоРазмеров)-1 Цикл
				Лист.Cells(СтрокаТИ.СтрокаИтога,Сч).FormulaR1C1=ФормулаВ;
				//		Сообщить(ФормулаВ);
				Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога).FormulaR1C1=ФормулаГ;
				//		Сообщить(ФормулаГ);
			КонецЦикла;                                                         
			
			Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога+2).FormulaR1C1=ФормулаВ; //сумма
			//	сообщить(ФормулаВ);
			
			Если СтрокаТИ.ИмяИтога="Модель" Тогда	//сумма 		
				Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога+2).FormulaR1C1="=RC[-2]*RC[-1]";
			КонецЕсли;
			
			ПрописатьФормулы(ТД,Лист,СтрокиДанных,ЧислоРазмеров);
		КонецЕсли;		                              
		
		// Группировка строк
		Если СтрокаТИ.ИмяИтога="Марка" Тогда			
			НачСтрока=СтрокаТИ.СтрокаИтога+1;
			КонСтрока=НачСтрока+СтрокаТИ.Строки.Количество()-1;			
			
			Лист.Rows(""+НачСтрока+":"+КонСтрока).Group();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //ПрописатьФормулы


Функция РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ,ИтогПоСтроке=Ложь) Экспорт
	НачКол=ОблИтог.ШиринаТаблицы;		
	ТекЧислоРазмеров=0;
	
	Если ИмяСекции="Итого" Тогда
		ИмяГруппировкиРР=Неопределено;
	ИначеЕсли ИмяСекции="РазмерныйРяд" Тогда		
		ИмяГруппировкиРР="РазмерныйРяд";
	Иначе
		ИмяГруппировкиРР="РазмерныйРяд";			
	КонецЕсли;	
	
	ВыборкаРМ=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Размер",ИмяГруппировкиРР);	
	
	Пока ВыборкаРМ.Следующий() И ТекЧислоРазмеров<МаксЧислоРазмеров Цикл		
		
		ОблСклад=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
		
		ТекЧислоРазмеров=ТекЧислоРазмеров+1;
		
		ОблСклад.Параметры.Заполнить(ВыборкаРМ);
		
		//крохин начало 17.03.2011
		//поменял упорядочивание размеров со ссылок на коды
		Если ИмяСекции="Шапка" Тогда
			попытка
				ОблСклад.Параметры.Размер = Справочники.Размеры.НайтиПоКоду(ВыборкаРМ.Размер);
			исключение
			конецпопытки;
		КонецЕсли;
		//крохин конец
		
		
		Если ИмяСекции="РазмерныйРяд" И НЕ ИтогПоСтроке Тогда	
		ИначеЕсли ИмяСекции="Модель" Тогда			
		ИначеЕсли ИмяСекции="Итого" Тогда			
		ИначеЕсли ИмяСекции="Цвет" Тогда
			ТекОбл=ОблСклад.Область();	
			КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет);
			Если ПустаяСтрока(КодТовара) Тогда
				ТекОбл.ЦветФона		=Новый Цвет(128,128,128);
			Иначе
				КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет);				
				Если ВыборкаРМ.КолКон<>Null И ВыборкаРМ.КолКон>0 Тогда
					ТекОбл.ЦветФона=Новый Цвет(255,255,153);			
					ОблСклад.Параметры.КодТовара=КодТовара;
					//Если фВыводитьКоличество Тогда
					//	ОблСклад.Параметры.Остаток = ВыборкаРМ.КолКон;
					//КонецЕсли;					
				Иначе
					ТекОбл.ЦветФона=Новый Цвет(192,192,192);
					Если фНеКонтролироватьОстатки Тогда
						ОблСклад.Параметры.КодТовара=КодТовара;					
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли; 
		
		ОблИтог.Присоединить(ОблСклад);
	КонецЦикла; 
	
	ОблСклад=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
	Для Сч=ТекЧислоРазмеров+1 По МаксЧислоРазмеров Цикл
		ОблИтог.Присоединить(ОблСклад);
	КонецЦикла;
	
	Если ИмяСекции="Шапка" Тогда
		ОблСклад=ОблИтог.Область(1,НачКол+1,1,ОблИтог.ШиринаТаблицы);
		ОблСклад.Объединить();
		ОблСклад.Текст					=Выборка.РазмерныйРяд;
		ОблСклад.ВертикальноеПоложение	=ВертикальноеПоложение.Центр;
		ОблСклад.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;	
	КонецЕсли;		
	
	ОблИтого=Макет.ПолучитьОбласть(ИмяСекции+"|Конец");
	ОблИтого.Параметры.Заполнить(Выборка);
	Если ИмяСекции="Модель" Тогда
		ОблИтого.Параметры.Цена=ТекЦена;	
	КонецЕсли;
	
	ОблИтог.Присоединить(ОблИтого);	
КонецФункции // РазвернутьпоРазмерам()

Функция РазвернутьПоСкладам(Выборка,ИмяСекции,МаксЧислоРазмеров) Экспорт	
	ОблИтог=Новый ТабличныйДокумент;
	
	ОблНачало=Макет.ПолучитьОбласть(ИмяСекции+"|Начало");
	ОблНачало.Параметры.Заполнить(Выборка);
	//крохин начало 02.03.2012
	Если ИмяСекции="Цвет" Тогда
		Если Не ПустаяСтрока(Выборка.Цвет.РусскоеНаименование) Тогда
			ОблНачало.Параметры.ЦветРусскоеНаименование="("+Выборка.Цвет.РусскоеНаименование+")";
		КонецЕсли;
	КонецЕсли;
	//крохин конец 02.03.2012
	Если ИмяСекции="Модель" Тогда			
		Если НЕ ЗначениеЗаполнено(Выборка.Коллекция) Тогда
			ОблНачало.Параметры.Коллекция=Выборка.КоллекцияПредставление;					
		КонецЕсли;
		//Кухарь 19.04.18 начало
		////Под галку выводим ещё 1 поле и кое что меняем
		//если  ВыводитьНазваниеТовараДляСайта тогда
		//	ОблНачало.Параметры.МодельПредставление=Выборка.модель.названиетоварадлясайта;
		//	ОблНачало.Параметры.КодПроизводителя=Выборка.модель.РусскоеНаименование;
		//	ОблНачало.область(1,2,1,2).шрифт=новый Шрифт("Arial",10,Истина);
		//КонецЕсли;
		////Кухарь 19.04.18 конец
		
	КонецЕсли; 
	
	ОблИтог.Вывести(ОблНачало);
	
	Если фРазворачиватьПоСкладам Тогда
		ВыборкаСК	=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад","Все");
		
		Пока ВыборкаСК.Следующий() Цикл			
			Если ВыборкаСК.Склад=Null Тогда Продолжить КонецЕсли;
			Если ИмяСекции="РазмерныйРяд" ИЛИ ИмяСекции="Итого" Тогда			
				СтрокаТИ=ТИ.Найти(ВыборкаСК.Склад,"Склад");			
				Если СтрокаТИ=Неопределено Тогда
					СтрокаТИ=ТИ.Добавить();			
					СтрокаТИ.Склад=ВыборкаСК.Склад;
				КонецЕсли; 
			Иначе
				СтрокаТИ=Неопределено;
			КонецЕсли; 
			
			РазвернутьПоРазмерам(ВыборкаСК,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ);		
			
		КонецЦикла;	
		
		Если КоличествоСкладов>1 Тогда
			Если ИмяСекции="Итого" Тогда
				СтрокаСвертки="";
				Для Сч=1 По МаксЧислоРазмеров Цикл
					СтрокаСвертки=СтрокаСвертки+"Р_"+Сч+",";			
				КонецЦикла; 
				СтрокаСвертки=Лев(СтрокаСвертки,СтрДлина(СтрокаСвертки)-1);
				
				ТИ.Добавить();
				ТИ.Колонки.Добавить("Свертка");
				ТИ.Свернуть("Свертка",СтрокаСвертки);			
				
				СтрокаТИ=ТИ[0];
			КонецЕсли;
			
			РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ,Истина);		
		КонецЕсли;
	Иначе
		РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ);
	КонецЕсли; 
	
	
	Возврат ОблИтог;
КонецФункции // РазвернутьПоСкладам()

//нечаева 18,01,16+++
процедура  ССортировкойПоБрендам() Экспорт
	фВыводитьКартинки = ложь;
	фВключатьНули = ложь;
	фРазворачиватьПоСкладам = ложь;
	фНеКонтролироватьОстатки = ложь;
	ИспользоватьНоменклатурнуюМатрицу = ложь;
	
	// в темп сохраним
	ИмяФайлаЗаказа = КаталогВременныхФайлов() + "БЗ12313"+".xls";
	
	
	//крохин начало
	//ЗаписатьФормированиеОбработки(ЭтаФорма);
	//крохин конец
	
	
	НастроитьПостроитель();
	ПолучитьНастройкуОтчета();
	НастроитьПостроительПоУмолчанию();
	
	
	ТабличныйДокументРезультат = новый ТабличныйДокумент;	
	Если ПустаяСтрока(ИмяФайлаЗаказа) Тогда
		//	Предупреждение("Не указано имя файла бланка !");	
		//	Возврат;
	Иначе
		//крохин начало 25.12.2011
		//возможность сохранять в ексель без формул оставляем, если не выбран файл бланка. В этом случае бланк не загрузится
		//ЭлементыФормы.ТабличныйДокументРезультат.Защита = Истина;
		//крохин конец 25.12.2011
	КонецЕсли; 
	
	Если ПостроительОтчета.ВыбранныеПоля.Найти("КоллекцияПредставление")=Неопределено Тогда
		ПостроительОтчета.ВыбранныеПоля.Добавить("КоллекцияПредставление");
	КонецЕсли; 
	
	//
	//крохин начало 19.03.2012
	//номенклатурная матрица
	//Если ИспользоватьНоменклатурнуюМатрицу Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	МатрицаТовары.Номенклатура
	//	|ИЗ
	//	|	Документ.Матрица.Товары КАК МатрицаТовары
	//	|ГДЕ
	//	|	МатрицаТовары.Ссылка.Проведен
	//	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	//	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
	//	Запрос.УстановитьПараметр("Дата1",КонецДня(Дата2));
	//	Запрос.УстановитьПараметр("Дата2",НачалоДня(Дата2));
	//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	СписокНоменклатуры = Новый СписокЗначений;
	//	Пока Выборка.Следующий() Цикл
	//		СписокНоменклатуры.Добавить(Выборка.Номенклатура);	
	//	КонецЦикла;
	//	
	//	ОтборПоМатрице = ПостроительОтчета.Отбор.Добавить("Номенклатура");	
	//	ОтборПоМатрице.ВидСравнения=ВидСравнения.ВСпискеПоИерархии;
	//	ОтборПоМатрице.Значение = СписокНоменклатуры;
	//	ОтборПоМатрице.Использование = Истина;
	//КонецЕсли;
	//крохин конец 19.03.2012
	
	УправлениеВидимостью();
	
	
	//ЭлементыФормы.ТабличныйДокументРезультат.Очистить();
	
	ПостроительОтчета.Параметры.Вставить("Дата1",НачалоДня(Дата2));
	ПостроительОтчета.Параметры.Вставить("Дата2",КонецДня(Дата2));	
	
	
	//фактические остатки
	ПостроительОтчета.Параметры.Вставить("Остаток",1);			
	ПостроительОтчета.Параметры.Вставить("Резерв",-1);	
	
	ПостроительОтчета.Параметры.Вставить("ВключатьНули",фВключатьНули);		
	
	// отбор по номнклатуре
	
	СпНом =новый СписокЗначений;
	СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-000002")); //fnnbdf 40
	
	
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-063480"));
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-063481")); // поясное
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-063466")); // колготки и чулки
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-422349"));
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-063488"));
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-422359"));
	//СпНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-422360"));
	//
	
	ПостроительОтчета.Отбор.Номенклатура.Использование = истина;
	ПостроительОтчета.Отбор.Номенклатура.видсравнения = видсравнения.ВСпискеПоИерархии;
	ПостроительОтчета.Отбор.Номенклатура.Значение = СпНом;
	
	
	ПостроительОтчета.Выполнить();	
	
	Макет=ПолучитьМакет("Таблица");
	ТД=Новый ТабличныйДокумент;
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Начало");	
	ОблЗаголовок.Параметры.Дата2=ТекущаяДата();
	
	ТД.Вывести(ОблЗаголовок);
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Размер");	
	ТД.Присоединить(ОблЗаголовок);
	
	Результат=ПостроительОтчета.Результат;
	
	МаксЧислоРазмеров=0;	
	ВыборкаРР=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"РазмерныйРяд");
	Пока ВыборкаРР.Следующий() Цикл		
		ВыборкаР=ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Размер");		
		МаксЧислоРазмеров=Макс(ВыборкаР.Количество(),МаксЧислоРазмеров);		
	КонецЦикла; 
	
	ВыборкаСК			=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	КоличествоСкладов	=ВыборкаСК.Количество();
	
	ТИ=Новый ТаблицаЗначений;
	
	ТИ.Колонки.Добавить("Склад");
	Для Сч=1 По МаксЧислоРазмеров Цикл
		ТИ.Колонки.Добавить("Р_"+Сч,ПолучитьОписаниеТиповЧисла(19,0));	
	КонецЦикла;	
	
	ВыборкаМД		= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
	ВсегоМоделей	= ВыборкаМД.Количество();	
	
	ФиксацияСверху	= ТД.ВысотаТаблицы;	
	
	ТС=СоздатьТаблицуСтрок();
	
	СтрокаТС=ТС.Строки.Добавить();
	
	Если фВыводитьКартинки Тогда
		ТД.Область(,2,,2).ШиринаКолонки=25;
	КонецЕсли;	
	
	ТД.НачатьАвтогруппировкуСтрок();
	
	
	ВыборкаРР=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Брэнд");
	ВыборкаРР.Сбросить();
	Пока ВыборкаРР.Следующий() Цикл
		
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		ТекРР=ВыборкаРР.РазмерныйРяд;
		
		//ТД.Вывести(РазвернутьПоСкладам(ВыборкаРР,"Шапка",МаксЧислоРазмеров),1);
		//ТД.Вывести(РазвернутьПоСкладам(ВыборкаРР,"Брэнд",МаксЧислоРазмеров),1);
		
		выборкаБР=ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"РазмерныйРяд");
		
		//ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"Шапка",МаксЧислоРазмеров),1);
		
		Пока ВыборкаБР.Следующий() Цикл
			#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			#КонецЕсли
			
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"Шапка",МаксЧислоРазмеров),1);
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"Брэнд",МаксЧислоРазмеров),1);
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"РазмерныйРяд",МаксЧислоРазмеров),2);
			
			СтрокаБ=СтрокаТС.Строки.Добавить();
			СтрокаБ.СтрокаИтога=ТД.ВысотаТаблицы;
			СтрокаБ.ИмяИтога	="РазмерныйРяд";
			
			ВыборкаМД=ВыборкаБР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
			Пока ВыборкаМД.Следующий() Цикл
				#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
				#КонецЕсли
				
				ВсегоМоделей=ВсегоМоделей-1;
				
				#Если Клиент Тогда
				Состояние("Осталось: "+ВсегоМоделей);
				#КонецЕсли
				
				//ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
				
				
				//-------------------------------
				// Нечаева 27.11.2009 9:49:31 +
				
				//ТекЦена=ПолучитьЦенуНоменклатуры(ВыборкаМД.Модель,,ТипЦен,ТипЦен.Валюта,ПолучитьКурсВалюты(ТипЦен.Валюта,Дата2).Курс,Дата2);				
				ТекЦена=ЦенаКонтрагента1(ВыборкаМД.Модель,ТипЦен);
				
				
				////нечаева 20,08,014 +++
				//Если ИспользоватьЦеныМатрицы Тогда
				//					
				//		Цена2=ЦенаНоменклатурыПоМатрицеПоМодели(ВыборкаМД.Модель,Контрагент,фактадрес,Дата2);
				//		ТекЦена = Цена2;
				//	
				//КонецЕсли;
				////нечаева 20,08,014---
				
				
				
				// Нечаева 27.11.2009 9:49:39 -
				
				ТД.Вывести(РазвернутьПоСкладам(ВыборкаМД,"Модель",МаксЧислоРазмеров),2+ВыборкаМД.Уровень());			
				
				СтрокаМ=СтрокаБ.Строки.Добавить();
				СтрокаМ.СтрокаИтога=ТД.ВысотаТаблицы;
				СтрокаМ.ИмяИтога	="Модель";
				
				ВыборкаЦВ=ВыборкаМД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Цвет");
				Пока ВыборкаЦВ.Следующий() Цикл
					ТекОбласть=РазвернутьПоСкладам(ВыборкаЦВ,"Цвет",МаксЧислоРазмеров);
					ТД.Вывести(ТекОбласть,3+ВыборкаМД.Уровень());			
					
					СтрокаЦ=СтрокаМ.Строки.Добавить();
					СтрокаЦ.СтрокаИтога	=ТД.ВысотаТаблицы;
					СтрокаЦ.ИмяИтога	="Цвет";					
				КонецЦикла; 
				
				Если фВыводитьКартинки Тогда
					ВыборкаЦВ.Сбросить();
					ВыборкаЦВ.Следующий();
					ТекОбласть=РазвернутьПоСкладам(ВыборкаЦВ,"Картинка",МаксЧислоРазмеров);
					
					Пока ТД.ВысотаТаблицы-СтрокаМ.СтрокаИтога<11 Цикл
						#Если Клиент Тогда
						ОбработкаПрерыванияПользователя();
						#КонецЕсли
						ТД.Вывести(ТекОбласть);
						
						ТекОбласть.Область().ГраницаСверху=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
					КонецЦикла;				
					
					ФайлКартинки=Новый Файл(КаталогКартинок+ВыборкаМД.Модель.Код+".jpg");
					Если ФайлКартинки.Существует() Тогда
						Рисунок				= ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);					
						Рисунок.РазмерКартинки	=РазмерКартинки.реальныйразмер;
						Рисунок.Картинка 	= Новый Картинка(ФайлКартинки.ПолноеИмя);
						Рисунок.Расположить(ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы));
					КонецЕсли;				
				КонецЕсли;				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
	
	ТД.ЗакончитьАвтогруппировкуСтрок();	
	
	
	Выборка=Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ТД.Вывести(РазвернутьПоСкладам(Выборка,"Итого",МаксЧислоРазмеров));	
	КонецЕсли; 	
	
	СтрокаТС.СтрокаИтога=ТД.ВысотаТаблицы;
	
	//ЭлементыФормы.ТабличныйДокументРезультат.Вывести(ТД);
	//
	//ЭлементыФормы.ТабличныйДокументРезультат.ФиксацияСверху=ФиксацияСверху;
	//
	//УстановитьКолонтитулы(ЭлементыФормы.ТабличныйДокументРезультат);
	//ЭлементыФормы.ТабличныйДокументРезультат.ИмяПараметровПечати		="Параметры печати отчет: "+ИмяОтчета;	
	//
	////ЭлементыФормы.ПанельОтчета.ТекущаяСтраница = ЭлементыФормы.ПанельОтчета.Страницы["Результат"];
	//
	//Если ПустаяСтрока(ИмяФайлаЗаказа) Тогда
	//	Возврат;	
	//КонецЕсли; 
	
	////кухарь 05.02.13
	////было:
	////крохин начало 02.09.2011
	////по просьбе Кухаря, для увеличения максимального размера бланка
	////ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLS97);
	//ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLS95);		
	////крохин конец 02.09.2011
	//стало:
	
	//	ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLSX);
	Если тд.ВысотаТаблицы<1000 тогда
		ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLS97);
	иначе
		//Сообщить("Файл будет сохранён в эксель 95, для сохранения в эксель 97 либо пересохраните полученный файл, либо сформируйте бланк по меньшему количеству позиций");
		ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLS95);
	КонецЕсли;
	//кухарь 05.02.13 конец
	
	Ексель=Новый COMОбъект("Excel.Application"); 	
	Книга=Ексель.WorkBooks.Open(ИмяФайлаЗаказа);
	Лист=Книга.WorkSheets(1);
	
	#Если Клиент Тогда
	Состояние("Запись кодов номенклатуры.....");
	#КонецЕсли
	ПрописатьКодыТоваров(ТД,Ексель,Книга,Лист);
	
	#Если Клиент Тогда
	Состояние("Запись формул.....");
	#КонецЕсли
	ПрописатьФормулы(ТД,Лист,ТС.Строки,МаксЧислоРазмеров);
	
	//Катаев+ 12/02/14 В 9 строке делаем подмену для нуля имеющего формат отличный от Основной
	Для кол = 1 по 100 Цикл
		Если Лист.Cells(9, кол).Value = 0 и Лев(Лист.Cells(9, кол).NumberFormat,5) ="# ##0" Тогда
			Ф = СтрЗаменить(Лист.Cells(9, кол).NumberFormat,"# ##0", "");
			ДлинаФ = стрДлина(Ф);
			Значение = "0"+Прав(Лев(Ф, ДлинаФ-1),ДлинаФ-2);
			Лист.Cells(9, кол).NumberFormat = "Основной";
			Лист.Cells(9, кол).Value = Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Катаев- 12/02/14
	Ексель.ActiveWindow.DisplayZeros	=0;
	Ексель.ActiveWindow.DisplayGridlines=0;
	Лист.Outline.SummaryRow = 0;
	//крохин начало 29.11.2011
	//Лист.Protect("1234",1,1,1,0,0,1,1,0,0,0,0,0,0,1,0);
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Лист.Protect("*$*$*$",1,1,1,0,0,1,1,0,0,0,0,0,0,1,0);
	Лист.Protect(РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_ЕЕ).Пароль,1,1,1,0,0,1,1,0,0,0,0,0,0,1,0);
	// Ихсанов Д. А. Конец  14.10.2025
	//крохин конец 29.11.2011
	
	
	//	Лист.Protect("*$*$*$",1,1,1,0,0,1,1,0,0,0,0,0,0,1,0);
	
	
	Книга.Save();	
	Ексель.Quit();	
	
	ОтправитьНаФТПКлиенту(ИмяФайлаЗаказа);
	
	
	//	Состояние("Обработка завершена.");
	//	Предупреждение("Сформирован бланк заказа: "+Символы.ПС+ИмяФайлаЗаказа,2);
	Сообщить("Сформирован бланк заказа: "+Символы.ПС+ИмяФайлаЗаказа);
	
КонецПроцедуры	
//нечаева 18,01,16---

// КНОПКИ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ
Процедура Сформировать(Элемент=Неопределено) Экспорт
	ССортировкойПоБрендам();
	
	пп = 1;
	возврат;
	
КонецПроцедуры

//_____________________________________________________________________________
Процедура ПрописатьКодыТоваров(ТД,Ексель,Книга,Лист) Экспорт
	Для Кол=1 по ТД.ШиринаТаблицы	Цикл
		Для Стр=1 по ТД.ВысотаТаблицы Цикл
			КодТовара=ТД.Область(Стр,Кол,Стр,Кол).Расшифровка;		    
			Если НЕ ПустаяСтрока(КодТовара) Тогда
				#Если Клиент Тогда
				Состояние("Установка кодов: "+КодТовара);
				#КонецЕсли
				Попытка               
					КодПозиции="R"+СтрЗаменить(КодТовара,"-","_____");
					Лист.Cells(Стр,Кол).Name=КодПозиции;
					Книга.Names(КодПозиции).Visible=0;
					Ексель.Evaluate(Книга.Names(КодПозиции).Value).Locked=0;					
				Исключение
					Сообщить("Кривой код: "+КодТовара+" "+ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;  	    
	КонецЦикла;
КонецПроцедуры //ПрописатьКодыТоваров

Процедура кпФормаКнСохранитьНастройку(Кнопка)  Экспорт
	//	СохранитьНастройку(ЭтаФорма);	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////
//СОБЫТИЯ ДЕРЕВЬЕВ НАСТРОЕК
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)   Экспорт
	//ВыборСтрокиДереваНастроек(ЭтаФорма,ВыбраннаяСтрока);	
КонецПроцедуры

Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)  Экспорт
	//АктивизацияСтрокиДереваНастроек(ЭтаФорма,Элемент);
КонецПроцедуры


//---------------------------------------------------------------

Процедура ОтправитьНаФТПКлиенту(ИмяФайлаН) Экспорт
	
	
	////----------------------------------------------
	////	 переносим автоматом на их фтп - сервер
	////----------------------------------------------
	
	//Путь="\\SRVECODE\EdiConnector2\Stoletov\reestr";
	
	//	Светлана, доступ к фтп
	//Адрес: 103.234.36.48
	//Логин: *%*%*%
	//Пароль: *$*$*$
	
	
	
	
	Попытка
		//Сервер=Новый FTPСоединение("ftp.stoletov.ru",,"*%*%*%","*$*$*$"); 
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//Сервер=Новый FTPСоединение("103.234.36.48",,"*%*%*%","*$*$*$");
		Сервер = Новый FTPСоединение("103.234.36.48",,
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКлиента).Логин,
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКлиента).Пароль);
		// Ихсанов Д. А. Конец  14.10.2025
	Исключение
		//КритичОшибки.Добавить("Файл реестра не передан на ФТП "+ОписаниеОшибки());
		//Если КритичОшибки.Количество()>0 Тогда
		//СообщитьКритОшибки();
		//КонецЕсли;
		//Возврат;
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	
	//	Имя=ИмяФайлаН+".dbf";
	
	// удаляем старый прайс-лист)
	Попытка
		Сервер.Удалить(ИмяФайлаН);  
	Исключение
	КонецПопытки;
	//
	Попытка
		Сервер.Записать(ИмяФайлаН);
	Исключение
		//КритичОшибки.Добавить("Файл реестра не передан на ФТП  "+ОписаниеОшибки() );
	КонецПопытки;
	
	
	//Если КритичОшибки.Количество()>0 Тогда
	//	СообщитьКритОшибки();
	//КонецЕсли;	
	
	Сервер=Неопределено;
	
	
	
КонецПроцедуры



ПостроительОтчета = новый ПостроительОтчета;	
фВыводитьКартинки = ложь;
фВключатьНули = ложь;
фРазворачиватьПоСкладам = ложь;
фНеКонтролироватьОстатки = ложь;
ИспользоватьНоменклатурнуюМатрицу = ложь;
